DataProcessors/Renault_Связь1сИПланшет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_Связь1сИПланшет</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Табл</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_Автосервис_НастройкиСотрудниковПланшет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Автосервис_НастройкиСотрудниковПланшет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Автосервис_СотрудникиИПрофилиПланшет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Автосервис_СотрудникиИПрофилиПланшет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Автосервис_ПрофилиПланшета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ПользователиИШаблоныПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПользователиИШаблоныПравИНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваИНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПраваИНастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Автосервис_СписокПовреждений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Автосервис_СписокПовреждений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ParentID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Bookmark</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЭлементаВ1с</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЗоныПоврежденийАвто</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Text</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>TextType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Автосервис_ВидыПовреждений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПовреждениеВ1с</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Автосервис_Повреждения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АвтоработаВ1с</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Renault_CRM_ПриемкаАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_CRM_ПриемкаАвтомобиля</Name>
			<BasedOn>
				<xr:Item>Document.Renault_CRM_ЗаявкаНаСервис</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Renault_ПоврежденияАвтомобилей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЧерновикиАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Машиноместо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ВидыСостоянийДокументовАвтосервиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИзменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьАвтомобиля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентБудетОжидатьОкончаниеРемонта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятБезОсмотра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьЗамененныеЗЧ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интерактивная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладалецАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемкаИзПланшета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоврежденияАвто</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Renault_ЦветаСертификатаКонтроля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзноса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботаАктуальна</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендуемаяДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыбранныеАкции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ЦентрализованныеАкции</v8:Type>
								<v8:Type>cfg:CatalogRef.Renault_АкцииИСкидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавлена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Renault_ВидыСостоянийДокументовАвтосервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ВидыСостоянийДокументовАвтосервиса</Name>
			<Comment>Состояния документов автосервиса (DMS)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Comment>Порядок сортировки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>Цвет заказ-наряда в журналах</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДляОтображенияМонитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветМонитор</Name>
					<Comment>Цвет заказ-наряда в журналах</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_Автосервис_ПрофилиПланшета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_Автосервис_ПрофилиПланшета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаголовокПрофиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProfileID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Renault_Связь1сИПланшет/Ext/ObjectModule.bsl
Процедура ВыполнитьЗаписьВБазуПланшета()Экспорт
	
	Клиенты = ПолучитьКлиентовКВыгрузке();
	ДЦ = ПолучитьВсеДЦКВыгрузке();
	МастераПриемщики = ПолучитьМастеровПриемщиковКВыгрузке();
	Профили = ПолучитьПрофилиКВыгрузке();
	СвязиПрофилей = ПолучитьСвязьСОтрудниковИПрофилей();
	Статусы = ПолучитьСтатусыКВыгрузке();
	//ЗагрузитьПоврежденияВ1с();
	Повреждения = ПолучитьСписокПовреждений();
	гром = 1;
	ВыполнитьMergeВSQL(КЛиенты,"dbo.Client","ClientID");	
	ВыполнитьMergeВSQL(ДЦ,"dbo.Company","CompanyID");
	ВыполнитьMergeВSQL(МастераПриемщики,"dbo.EmployeeData","EmployeeID");
	ВыполнитьMergeВSQL(Профили,"dbo.Profile","ProfileID");
	ОчиститьТаблицуВSQL("dbo.ProfileToEmployee");
	ВыполнитьInsertВSQL(СвязиПрофилей,"dbo.ProfileToEmployee");
	ВыполнитьMergeВSQL(Статусы,"dbo.OperationStatus","UID");
	ВыполнитьMergeВSQL(Повреждения,"dbo.Text","GUID");

	СтатусыИзБазы = ПолучитьТаблицу("dbo.OperationStatus");
	Для Каждого Статус Из СтатусыИзБазы Цикл
		Попытка
		НайденнаяСсылка = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ПолучитьСсылку(Новый УникальныйИдентификатор(Статус.UID));
		Если ЗначениеЗаполнено(НайденнаяСсылка) тогда
			Об = НайденнаяСсылка.ПолучитьОбъект();
			Об.ID = Статус.ID;
			Об.Записать();
		КонецЕсли;
	Исключение
		КонецПопытки;
	КонецЦикла;
	Приемки = ПолучитьПриемкиАвтомобилей();
	ВыполнитьMergeВSQL(Приемки,"dbo.Operation","OperationID");
	
КонецПроцедуры


Функция ПараметрыПодключенияКБазеПланшет() Экспорт
	
	Ответ = Новый Структура();
	Ответ.Вставить("Драйвер","SQL Server Native Client 11.0");
	//Ответ.Вставить("Драйвер","SQL Server Native Client 10.0");
	Ответ.Вставить("АдресСервера","TEST-DMS-SERVER\EXPR2012");
	Ответ.Вставить("БазаДанных","Renault");
	Ответ.Вставить("Логин","sa");
	Ответ.Вставить("Пароль","123");
	Возврат Ответ;
	
	
КонецФункции

Функция СформироватьСтрокуСоединенияКБазеПланшет(Параметры = Неопределено) экспорт
	
	Параметры = ПараметрыПодключенияКБазеПланшет();
	Ответ = "Driver={"+Параметры.Драйвер+"};Server="+Параметры.АдресСервера+
	";Database="+Параметры.БазаДанных+";Uid="+Параметры.Логин+";Pwd="+Параметры.Пароль+";";
	//"Driver={"+Параметры.Драйвер+"}; SERVER ="+Параметры.АдресСервера+
	//";Database ="+Параметры.БазаДанных+";user id="+Параметры.Логин+";Password="+Параметры.Пароль+";";
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьКлиентовКВыгрузке()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Renault_CRM_ПриемкаАвтомобиля.Клиент.Фамилия КАК Surname,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Клиент.Имя КАК FirstName,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Клиент.Отчество КАК Patronymic,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Клиент.Ссылка КАК Ссылка,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Клиент.Наименование КАК FullName
	                      |ИЗ
	                      |	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	                      |ГДЕ
	                      |	Renault_CRM_ПриемкаАвтомобиля.Состояние В(&Состояния)");
	ДопустимыеСосотояния = ПолучитьДопустимыеСостоянияПриемки();
	Запрос.УстановитьПараметр("Состояния",ДопустимыеСосотояния);
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаДанных.Колонки.Добавить("ClientID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
	Для Каждого Зап Из ТаблицаДанных Цикл
		Зап.ClientID = Строка(Зап.Ссылка.Уникальныйидентификатор());
	КонецЦикла;
	ТаблицаДанных.Колонки.Удалить("Ссылка");
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьДопустимыеСостоянияПриемки()
	
	ДопустимыеСосотояния = Новый Массив();
	ДопустимыеСосотояния.Добавить(Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ВРаботе);
	//ДопустимыеСосотояния.Добавить(Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ВыдачаНачата);
	ДопустимыеСосотояния.Добавить(Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка);
	ДопустимыеСосотояния.Добавить(Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.КлиентОжидает);
	ДопустимыеСосотояния.Добавить(Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ПриемкаНачата);
	Возврат ДопустимыеСосотояния;
	
КонецФункции

Функция ПолучитьДЦКВыгрузке()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Renault_CRM_ПриемкаАвтомобиля.ДилерскийЦентр.Ссылка КАК Ссылка,
	                      |	Renault_CRM_ПриемкаАвтомобиля.ДилерскийЦентр.Наименование КАК Name
	                      |ИЗ
	                      |	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	                      |ГДЕ
	                      |	Renault_CRM_ПриемкаАвтомобиля.Состояние В(&Состояния)");
	ДопустимыеСосотояния = ПолучитьДопустимыеСостоянияПриемки();
	Запрос.УстановитьПараметр("Состояния",ДопустимыеСосотояния);
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаДанных.Колонки.Добавить("CompanyID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
	Для Каждого Зап Из ТаблицаДанных Цикл
		Зап.CompanyID = Строка(Зап.Ссылка.Уникальныйидентификатор());
	КонецЦикла;
	ТаблицаДанных.Колонки.Удалить("Ссылка");
	ПустойДЦ = ТаблицаДанных.Добавить();
	ПустойДЦ.CompanyID ="00000000-0000-0000-0000-000000000000"  ;
	ПустойДЦ.Name ="ДЦ Незаполнен";

	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьВсеДЦКВыгрузке()
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	CRM_ДилерскиеЦентры.Ссылка,
	                      |	CRM_ДилерскиеЦентры.Наименование КАК Name
	                      |ИЗ
	                      |	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	                      |ГДЕ
	                      |	CRM_ДилерскиеЦентры.ПометкаУдаления = ЛОЖЬ");
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаДанных.Колонки.Добавить("CompanyID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
	Для Каждого Зап Из ТаблицаДанных Цикл
		Зап.CompanyID = Строка(Зап.Ссылка.Уникальныйидентификатор());
	КонецЦикла;
	ТаблицаДанных.Колонки.Удалить("Ссылка");
	ПустойДЦ = ТаблицаДанных.Добавить();
	ПустойДЦ.CompanyID ="00000000-0000-0000-0000-000000000000"  ;
	ПустойДЦ.Name ="ДЦ Незаполнен";

	Возврат ТаблицаДанных;

КонецФункции	

Функция ПолучитьМастеровПриемщиковКВыгрузке()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Renault_CRM_ПриемкаАвтомобиля.Машиноместо.Наименование КАК FullName,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Машиноместо.Ссылка КАК Ссылка,
	                      |	Renault_CRM_ПриемкаАвтомобиля.ДилерскийЦентр.Ссылка КАК ДЦ,
	                      |	Renault_Автосервис_НастройкиСотрудниковПланшет.Логин КАК Name,
	                      |	Renault_Автосервис_НастройкиСотрудниковПланшет.Пароль КАК Password
	                      |ИЗ
	                      |	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Автосервис_НастройкиСотрудниковПланшет КАК Renault_Автосервис_НастройкиСотрудниковПланшет
	                      |		ПО Renault_CRM_ПриемкаАвтомобиля.Машиноместо = Renault_Автосервис_НастройкиСотрудниковПланшет.Сотрудник
	                      |ГДЕ
	                      |	Renault_CRM_ПриемкаАвтомобиля.Состояние В(&Состояния)");
	ДопустимыеСосотояния = ПолучитьДопустимыеСостоянияПриемки();
	Запрос.УстановитьПараметр("Состояния",ДопустимыеСосотояния);
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаДанных.Колонки.Добавить("EmployeeID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
	ТаблицаДанных.Колонки.Добавить("CompanyID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));

	Для Каждого Зап Из ТаблицаДанных Цикл
		Зап.EmployeeID = Строка(Зап.Ссылка.Уникальныйидентификатор());
	    Зап.CompanyID = Строка(Зап.ДЦ.Уникальныйидентификатор());
	КонецЦикла;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Renault_Автосервис_СотрудникиИПрофилиПланшет.Сотрудник.Ссылка КАК Ссылка,
	                      |	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр.Ссылка КАК ДЦ,
	                      |	Renault_Автосервис_СотрудникиИПрофилиПланшет.Сотрудник.Наименование КАК FullName,
	                      |	Renault_Автосервис_НастройкиСотрудниковПланшет.Логин КАК Login,
	                      |	Renault_Автосервис_НастройкиСотрудниковПланшет.Пароль КАК Password
	                      |ИЗ
	                      |	РегистрСведений.Renault_Автосервис_СотрудникиИПрофилиПланшет КАК Renault_Автосервис_СотрудникиИПрофилиПланшет
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	                      |		ПО Renault_Автосервис_СотрудникиИПрофилиПланшет.Сотрудник = Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Автосервис_НастройкиСотрудниковПланшет КАК Renault_Автосервис_НастройкиСотрудниковПланшет
	                      |		ПО Renault_Автосервис_СотрудникиИПрофилиПланшет.Сотрудник = Renault_Автосервис_НастройкиСотрудниковПланшет.Сотрудник");
	ТаблицаМастеров = Запрос.Выполнить().Выгрузить();
	Для Каждого Тек Из ТаблицаМастеров Цикл
		Поиск = ТаблицаДанных.Найти(Тек.Ссылка,"Ссылка");
		Если Не ЗначениеЗаполнено(Поиск) Тогда
			Зап =  ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(Зап,Тек);
			Зап.EmployeeID = Строка(Зап.Ссылка.Уникальныйидентификатор());
			Если  ЗначениеЗаполнено(Зап.ДЦ) Тогда
				Зап.CompanyID = Строка(Зап.ДЦ.Уникальныйидентификатор());
			Иначе
				Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
				Если Выборка.Следующий() Тогда
					Зап.CompanyID = Выборка.Ссылка.УникальныйИдентификатор();
				Иначе
					Зап.CompanyID = "00000000-0000-0000-0000-000000000000";
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаДанных.Колонки.Удалить("Ссылка");
	ТаблицаДанных.Колонки.Удалить("ДЦ");
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьПрофилиКВыгрузке()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Renault_Автосервис_ПрофилиПланшета.Ссылка КАК Ссылка,
	                      |	Renault_Автосервис_ПрофилиПланшета.Наименование КАК Name,
	                      |	Renault_Автосервис_ПрофилиПланшета.ЗаголовокПрофиля КАК Title
	                      |ИЗ
	                      |	Справочник.Renault_Автосервис_ПрофилиПланшета КАК Renault_Автосервис_ПрофилиПланшета
	                      |ГДЕ
	                      |	Renault_Автосервис_ПрофилиПланшета.ПометкаУдаления = ЛОЖЬ");
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаДанных.Колонки.Добавить("ProfileID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
	Для Каждого Зап Из ТаблицаДанных Цикл
		Зап.ProfileID = Строка(Зап.Ссылка.Уникальныйидентификатор());
	    
	КонецЦикла;
	ТаблицаДанных.Колонки.Удалить("Ссылка");
	Возврат ТаблицаДанных;

	
КонецФункции

Функция ПолучитьСвязьСОтрудниковИПрофилей()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Renault_Автосервис_СотрудникиИПрофилиПланшет.Сотрудник.Ссылка,
	                      |	Renault_Автосервис_СотрудникиИПрофилиПланшет.Профиль.Ссылка
	                      |ИЗ
	                      |	РегистрСведений.Renault_Автосервис_СотрудникиИПрофилиПланшет КАК Renault_Автосервис_СотрудникиИПрофилиПланшет");
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаДанных.Колонки.Добавить("ProfileID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
	ТаблицаДанных.Колонки.Добавить("EmployeeID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));

	Для Каждого Зап Из ТаблицаДанных Цикл
		Зап.ProfileID = Строка(Зап.ПрофильСсылка.Уникальныйидентификатор());
	    Зап.EmployeeID = Строка(Зап.СотрудникСсылка.Уникальныйидентификатор());
	КонецЦикла;
	ТаблицаДанных.Колонки.Удалить("СотрудникСсылка");
	ТаблицаДанных.Колонки.Удалить("ПрофильСсылка");

	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьСтатусыКВыгрузке()
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Renault_ВидыСостоянийДокументовАвтосервиса.Наименование КАК StatusText,
	                      |	Renault_ВидыСостоянийДокументовАвтосервиса.Status,
	                      |	Renault_ВидыСостоянийДокументовАвтосервиса.Ссылка
	                      |ИЗ
	                      |	Справочник.Renault_ВидыСостоянийДокументовАвтосервиса КАК Renault_ВидыСостоянийДокументовАвтосервиса
	                      |ГДЕ
	                      |	Renault_ВидыСостоянийДокументовАвтосервиса.ID > 0
	                      |	И Renault_ВидыСостоянийДокументовАвтосервиса.ПометкаУдаления = ЛОЖЬ");
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаДанных.Колонки.Добавить("UID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
	Для Каждого Зап Из ТаблицаДанных Цикл
		Зап.UID = Строка(Зап.Ссылка.Уникальныйидентификатор());
	    
	КонецЦикла;
	ТаблицаДанных.Колонки.Удалить("Ссылка");

	Нов = ТаблицаДанных.Добавить();
	Нов.StatusText ="Без статуса";
	Нов.Status ="Empty";
	Нов.UID = "00000000-0000-0000-0000-000000000000";
	Возврат ТаблицаДанных;
	
КонецФункции


Функция ПолучитьПриемкиАвтомобилей()
  //   SELECT TOP 1000 [OperationID]
  //	,[ClientID]
  //	,[Date]
  //	,[Automobile]
  //	,[Mark]
  //	,[Model]
  //	,[VIN]
  //	,[Reason]
  //	,[Comments]
  //	,[StartTime]
  //	,[EndTime]
  //	,[Status]
  //	,[LicensePlate]
  //	,[EmployeeID]
  //FROM [Renault].[dbo].[Operation]
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Renault_CRM_ПриемкаАвтомобиля.Ссылка КАК Ссылка,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Клиент.Ссылка КАК Клиент,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Дата КАК Date,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Автомобиль.Наименование КАК Automobile,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Автомобиль.Модель.Наименование КАК Model,
	                      |	Renault_CRM_ПриемкаАвтомобиля.VIN КАК VIN,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Обращение.Примечание КАК Reason,
	                      |	Renault_CRM_ПриемкаАвтомобиля.ВремяНачала КАК StartTime,
	                      |	Renault_CRM_ПриемкаАвтомобиля.ВремяОкончания КАК EndTime,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Машиноместо.Ссылка КАК Машиноместо,
	                      |	Renault_CRM_ПриемкаАвтомобиля.ГосНомер КАК LicensePlate,
	                      |	""MARK"" КАК Mark,
	                      |	"" "" КАК Comments,
	                      |	Renault_CRM_ПриемкаАвтомобиля.Состояние.ID КАК Status
	                      |ИЗ
	                      |	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	                      |ГДЕ
	                      |	Renault_CRM_ПриемкаАвтомобиля.Состояние В(&Состояния)
	                      |	И Renault_CRM_ПриемкаАвтомобиля.Состояние.ID > 0");
	ДопустимыеСосотояния = ПолучитьДопустимыеСостоянияПриемки();
	Запрос.УстановитьПараметр("Состояния",ДопустимыеСосотояния);
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	ТаблицаДанных.Колонки.Добавить("OperationID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
	ТаблицаДанных.Колонки.Добавить("ClientID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
    ТаблицаДанных.Колонки.Добавить("EmployeeID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));

	Для Каждого Зап Из ТаблицаДанных Цикл
		Зап.EmployeeID = Строка(Зап.Машиноместо.Уникальныйидентификатор());
	    Зап.ClientID = Строка(Зап.Клиент.Уникальныйидентификатор());
		Зап.OperationID = Строка(Зап.Ссылка.Уникальныйидентификатор());
	КонецЦикла;
	ТаблицаДанных.Колонки.Удалить("Ссылка");
	ТаблицаДанных.Колонки.Удалить("Клиент");
	ТаблицаДанных.Колонки.Удалить("Машиноместо");

	Возврат ТаблицаДанных;
	
	
КонецФункции

Функция ОчиститьТаблицуВSQL(ИмяТаблицы)Экспорт
	Попытка
			Параметры = Неопределено;
			СтрокаПодключения  = СформироватьСтрокуСоединенияКБазеПланшет(Параметры);
			Ответ = Истина;
			Подключение = Новый COMОбъект("ADODB.Connection");
			
			Попытка
				Подключение.open(СтрокаПодключения);
			Исключение
				Инфа = ИнформацияОбОшибке();
				ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки();
				Ответ = Ложь;			
			КонецПопытки;
			ЗапросКБазе = "TRUNCATE TABLE "+Параметры.БазаДанных+"."+ИмяТаблицы;
						   
			Попытка
				Подключение.Execute(ЗапросКБазе);
				Возврат Истина; 
			Исключение
				Возврат Ложь;
			КонецПопытки;
			
	Исключение
		Возврат Ложь;
	КонецПопытки;

	
КонецФункции

Функция ВыполнитьInsertВSQL(ТаблицаДанных,ИмяТаблицы)Экспорт
	Попытка
		Если ТаблицаДанных.Количество()>0 Тогда	
			Параметры = Неопределено;
			СтрокаПодключения  = СформироватьСтрокуСоединенияКБазеПланшет(Параметры);
			Ответ = Истина;
			Подключение = Новый COMОбъект("ADODB.Connection");
			
			Попытка
				Подключение.open(СтрокаПодключения);
			Исключение
				Инфа = ИнформацияОбОшибке();
				ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки();
				Ответ = Ложь;			
			КонецПопытки;
			ЭтоПерв = Истина;
			ЗапросКБазе = "INSERT INTO "+Параметры.БазаДанных+"."+ИмяТаблицы+" ( ";
			ЭтоПервКолонка = Истина;
			Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
				Если ЭтоПервКолонка Тогда
					ЭтоПервКолонка = ложь;
				Иначе
					ЗапросКБазе= ЗапросКБазе +", ";
				КонецЕсли;
				ЗапросКБазе= ЗапросКБазе +Кол.Имя;
			КонецЦикла;

			ЗапросКБазе= ЗапросКБазе+") "+Символы.ПС+"VALUES ";
			ЭтоПервДанные = Истина;
			Для Каждого Данные Из ТаблицаДанных Цикл
				Если ЭтоПервДанные Тогда
					ЭтоПервДанные = Ложь;
				Иначе
					ЗапросКБазе =ЗапросКБазе+", "+Символы.ПС;
				КонецЕсли;
				ЗапросКБазе = ЗапросКБазе + "(";
				ЭтоПервКолонка = истина;
				Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
					Если ЭтоПервКолонка Тогда
						ЭтоПервКолонка = Ложь;
					Иначе
						ЗапросКБазе = ЗапросКБазе + ", ";
					КонецЕсли;
					СтрокаВставки = Данные[Кол.Имя];
					Если ТипЗнч(СтрокаВставки) =  Тип("Строка") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрокаВставки,3);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Число") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрЗаменить(СтрокаВставки,Символы.НПП,""),0);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Дата") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрЗаменить(СтрокаВставки,Символы.НПП,""),1);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Булево") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрЗаменить(СтрокаВставки,Символы.НПП,""),4);
                    Иначе
						СтрокаВставки = ДанныеВЗапрос(Строка(СтрокаВставки),2);
                    КонецЕсли;
                    					
					ЗапросКБазе = ЗапросКБазе + СтрокаВставки;		
								
				КонецЦикла;
				ЗапросКБазе = ЗапросКБазе +")";
				//ЗапросКБазе = ЗапросКБазе + "('"+Данные.VIN+"',"+ДанныеВАфм(Данные.DistrDate,1)+", "+ДанныеВАфм(Данные.BIR_Invoice,2)+")";

			КонецЦикла;
			ЗапросКБазе= ЗапросКБазе +";";
						   
			Попытка
				Подключение.Execute(ЗапросКБазе);
				Возврат Истина; 
			Исключение
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;	
	Исключение
		Возврат Ложь;
	КонецПопытки;

	
КонецФункции


Функция ВыполнитьMergeВSQL(ТаблицаДанных,ИмяТаблицы,КлючевоеПоле)Экспорт
	Попытка
		Если ТаблицаДанных.Количество()>0 Тогда	
			Параметры = Неопределено;
			СтрокаПодключения  = СформироватьСтрокуСоединенияКБазеПланшет(Параметры);
			Ответ = Истина;
			Подключение = Новый COMОбъект("ADODB.Connection");
			
			Попытка
				Подключение.open(СтрокаПодключения);
			Исключение
				Инфа = ИнформацияОбОшибке();
				ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки();
				Ответ = Ложь;			
			КонецПопытки;
			ЭтоПерв = Истина;
			ЗапросКБазе = "MERGE INTO "+Параметры.БазаДанных+"."+ИмяТаблицы+" AS Target "+Символы.ПС;
			ЗапросКБазе= ЗапросКБазе+"USING (VALUES ";
			ЭтоПервДанные = Истина;
			Для Каждого Данные Из ТаблицаДанных Цикл
				Если ЭтоПервДанные Тогда
					ЭтоПервДанные = Ложь;
				Иначе
					ЗапросКБазе =ЗапросКБазе+", "+Символы.ПС;
				КонецЕсли;
				ЗапросКБазе = ЗапросКБазе + "(";
				ЭтоПервКолонка = истина;
				Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
					Если ЭтоПервКолонка Тогда
						ЭтоПервКолонка = Ложь;
					Иначе
						ЗапросКБазе = ЗапросКБазе + ", ";
					КонецЕсли;
					СтрокаВставки = Данные[Кол.Имя];
					Если ТипЗнч(СтрокаВставки) =  Тип("Строка") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрокаВставки,3);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Число") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрЗаменить(СтрокаВставки,Символы.НПП,""),0);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Дата") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрЗаменить(СтрокаВставки,Символы.НПП,""),1);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Булево") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрЗаменить(СтрокаВставки,Символы.НПП,""),4);
                    Иначе
						СтрокаВставки = ДанныеВЗапрос(Строка(СтрокаВставки),2);
                    КонецЕсли;
                    					
					ЗапросКБазе = ЗапросКБазе + СтрокаВставки;		
								
				КонецЦикла;
				ЗапросКБазе = ЗапросКБазе +")";
				//ЗапросКБазе = ЗапросКБазе + "('"+Данные.VIN+"',"+ДанныеВАфм(Данные.DistrDate,1)+", "+ДанныеВАфм(Данные.BIR_Invoice,2)+")";

			КонецЦикла;
			//ЗапросКБазе= ЗапросКБазе +") AS Source (NewVIN, NewDistrDate,NewBIR_Invoice) "+Символы.ПС;
			ЗапросКБазе= ЗапросКБазе +") AS Source (";
			ЭтоПервКолонка = Истина;
			Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
				Если ЭтоПервКолонка Тогда
					ЭтоПервКолонка = ложь;
				Иначе
					ЗапросКБазе= ЗапросКБазе +", ";
				КонецЕсли;
				ЗапросКБазе= ЗапросКБазе +"New"+Кол.Имя;
			КонецЦикла;
			ЗапросКБазе= ЗапросКБазе +") "+Символы.ПС;
			ЗапросКБазе =ЗапросКБазе +"ON Target."+КлючевоеПоле+" = Source.New"+КлючевоеПоле+" "+Символы.ПС;
			ЗапросКБазе =ЗапросКБазе+"WHEN MATCHED THEN "+Символы.ПС+"UPDATE SET ";
			ЭтоПервКолонка = Истина;
			Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
				Если Кол.Имя <> КлючевоеПоле Тогда
					Если ЭтоПервКолонка Тогда
						ЭтоПервКолонка = ложь;
					Иначе
						ЗапросКБазе= ЗапросКБазе +", ";
					КонецЕсли;
					ЗапросКБазе= ЗапросКБазе +Кол.Имя+ " = Source.New"+Кол.Имя;
				КонецЕсли;
			КонецЦикла;
            ЗапросКБазе =ЗапросКБазе+Символы.ПС+"WHEN NOT MATCHED BY TARGET THEN "+Символы.ПС+"INSERT ( ";
			ЭтоПервКолонка = Истина;
			Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
				Если ЭтоПервКолонка Тогда
					ЭтоПервКолонка = ложь;
				Иначе
					ЗапросКБазе= ЗапросКБазе +", ";
				КонецЕсли;
				ЗапросКБазе= ЗапросКБазе +Кол.Имя;
				
			КонецЦикла;
            ЗапросКБазе =ЗапросКБазе+") VALUES ( ";
			ЭтоПервКолонка = Истина;
			Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
				Если ЭтоПервКолонка Тогда
					ЭтоПервКолонка = ложь;
				Иначе
					ЗапросКБазе= ЗапросКБазе +", ";
				КонецЕсли;
				ЗапросКБазе= ЗапросКБазе +"New"+Кол.Имя;
				
			КонецЦикла;
            ЗапросКБазе =ЗапросКБазе+");";
			//"UPDATE SET DistrDate = Source.NewDistrDate, BIR_Invoice=  Source.NewBIR_Invoice "+Символы.ПС+
			//"WHEN NOT MATCHED BY TARGET THEN "+Символы.ПС+
			//"INSERT (VIN, DistrDate,BIR_Invoice) VALUES (NewVIN, NewDistrDate,NewBIR_Invoice);";
				   
			Попытка
				Подключение.Execute(ЗапросКБазе);
				Возврат Истина; 
			Исключение
				Инф = ИнформацияОбОшибке();
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;	
	Исключение
		Инф = ИнформацияОбОшибке();
		
		Возврат Ложь;
	КонецПопытки;

	
КонецФункции

Функция ДанныеВЗапрос(ТекЗначение,ТипЗ = 0)Экспорт
	Если ТипЗ = 1 тогда //Дата , либо нулл
		Если Год(ТекЗначение) = 1 Тогда
			Возврат "NULL";
		Иначе
			Возврат "'"+Формат(ТекЗначение,"ДФ=""гггг-ММ-дд""")+"'";
		КонецЕсли;
	ИначеЕсли ТипЗ = 2  Тогда //Строка Либо Нул вместо пустой
		Если СтрДлина(ТекЗначение) = 0 Тогда
			Возврат "NULL";
		Иначе
			Возврат "'"+ТекЗначение+"'"; 
		КонецЕсли;
	ИначеЕсли ТипЗ =3  Тогда //Строка 
		Возврат "'"+ТекЗначение+"'"; 
	ИначеЕсли ТипЗ =4  Тогда //Булево
		Если ТекЗначение = Истина Тогда
			Возврат "ИСТИНА"; 
		Иначе
			Возврат "ЛОЖЬ"; 
		КонецЕсли;
	Иначе
		Возврат ТекЗначение;
	КонецЕсли;
	
КонецФункции   


Функция ПолучитьТаблицу(ИмяТаблицы,Каст = Ложь)
	Параметры = Неопределено;
	СтрокаПодключения  = СформироватьСтрокуСоединенияКБазеПланшет(Параметры);
	Ответ = Истина;
	Подключение = Новый COMОбъект("ADODB.Connection");
 	Попытка
		
		Подключение.open(СтрокаПодключения);
		
	Исключение
		
		Инфа = ИнформацияОбОшибке();
					
		ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки();
		Ответ = Ложь;			
	КонецПопытки;
	
		
	Записи = Новый COMОбъект("ADODB.RecordSet");
	ЗапросКБазе ="";
	ЗапросКБАзе="SELECT * FROM "+Параметры.БазаДанных+"."+ИмяТаблицы;
	Если Каст Тогда
		ЗапросКБАзе="SELECT *, CAST(Text AS VARCHAR(100))as Text FROM "+Параметры.БазаДанных+"."+ИмяТаблицы;
	КонецЕсли;
	
	Записи = Подключение.Execute(ЗапросКБазе);
	Таблица = новый ТаблицаЗначений();
	КоличествоПолей  = Записи.Fields.Count - 1;
	Для ПолеСч = 0 по КоличествоПолей Цикл 
		
		Если (Таблица.Колонки.Найти(Записи.Fields.item(ПолеСч).name ) =  Неопределено) Тогда
			Таблица.Колонки.Добавить(Записи.Fields.item(ПолеСч).name);
		КонецЕсли;
		
	КонецЦикла;
	Пока Записи.EOF  = ложь Цикл
		НоваяСтрока = Таблица.Добавить();
		 Для ПолеСч = 0 по КоличествоПолей Цикл 
			Поле = Записи.Fields.item(ПолеСч);
			//Если ЭтоПолеТребуетПреобразования(Поле.name) Тогда
				//Если ТипЗнч(Поле.Value) = Тип("Строка") Тогда
				//	НоваяСтрока[Поле.name] = СтрокаSQLВДату(Поле.Value);
				//Иначе
					//НоваяСтрока[Поле.name] = Поле.Value;
				//КонецЕсли;
			//Иначе
			НоваяСтрока[Поле.name] = Поле.Value;
			//КонецЕсли;
		КонецЦикла;
		
				
		Записи.MoveNext();
	Конеццикла;
		 
	 Возврат Таблица;

	
КонецФункции


Процедура ЗагрузитьПоврежденияВ1с() Экспорт
	
	ПоврежденияВр = ПолучитьТаблицу("dbo.Text",Истина);
	ПоврежденияВр.Колонки.TextType.Имя = "TextType_sql";
	ПоврежденияВр.Колонки.Добавить( "TextType");
	Для Каждого Тек Из ПоврежденияВр Цикл
		Тек.TextType = Справочники.Renault_Автосервис_ВидыПовреждений.НайтиПоКоду(Тек.TextType_sql);
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Renault_Автосервис_СписокПовреждений.ID,
		                      |	Renault_Автосервис_СписокПовреждений.ParentID,
		                      |	Renault_Автосервис_СписокПовреждений.Bookmark,
		                      |	Renault_Автосервис_СписокПовреждений.ИмяЭлементаВ1с,
		                      |	Renault_Автосервис_СписокПовреждений.Text,
		                      |	Renault_Автосервис_СписокПовреждений.TextType,
		                      |	Renault_Автосервис_СписокПовреждений.ПовреждениеВ1с,
		                      |	Renault_Автосервис_СписокПовреждений.GUID
		                      |ИЗ
		                      |	РегистрСведений.Renault_Автосервис_СписокПовреждений КАК Renault_Автосервис_СписокПовреждений
		                      |ГДЕ
		                      |	Renault_Автосервис_СписокПовреждений.GUID = &GUID");
		Запрос.УстановитьПараметр("GUID",Тек.GUID);
		Выборка = Запрос.Выполнить().Выбрать();
		Мен = РегистрыСведений.Renault_Автосервис_СписокПовреждений.СоздатьМенеджерЗаписи();
		Если Выборка.Следующий() тогда
			ЗаполнитьЗначенияСвойств(Мен,Выборка);
			Мен.Прочитать();
			ЗаполнитьЗначенияСвойств(Мен,Тек);
			Мен.Записать(Истина);
		Иначе
			ЗаполнитьЗначенияСвойств(Мен,Тек);
			Мен.GUID = Строка(Новый УникальныйИдентификатор());
			Мен.Записать(Истина);
		КонецЕсли;
		
		
	КонецЦикла;
	//Наб = РегистрыСведений.Renault_Автосервис_СписокПовреждений.СоздатьНаборЗаписей();
	//Наб.Загрузить(ПоврежденияВр);
	//Наб.Записать(Истина);
	
	
	
КонецПроцедуры


Функция ПолучитьСписокПовреждений()
	Запрос = новый запрос("ВЫБРАТЬ
	                      |	Renault_Автосервис_СписокПовреждений.ParentID,
	                      |	Renault_Автосервис_СписокПовреждений.Bookmark,
	                      |	Renault_Автосервис_СписокПовреждений.Text,
	                      |	Renault_Автосервис_СписокПовреждений.TextType.Код КАК TextType,
	                      |	Renault_Автосервис_СписокПовреждений.GUID
	                      |ИЗ
	                      |	РегистрСведений.Renault_Автосервис_СписокПовреждений КАК Renault_Автосервис_СписокПовреждений");
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаДанных;
	
	
КонецФункции

Функция ПолучитьТаблицуПоврежденийПоСтроке(вхСтрока)экспорт
	Табл.Очистить();
	//Табл = Новый ТаблицаЗначений();
	//Табл.Колонки.Добавить("ИмяЭлемента");
	//Табл.Колонки.Добавить("Повреждение");
	//Табл.Колонки.Добавить("Комментарий");

	Перв = Найти(вхСтрока,"[");
	Посл = Найти(вхСтрока,"]");
	Если (Перв>0) И (Посл>0) Тогда 
		Разбор = Сред(вхСтрока,Перв+1,Посл-Перв-1);
		МассивСтрок = РазложитьСтрокуВМассив(Разбор,"},{");
		Для Каждого Стр Из МассивСтрок Цикл
			Разб = СтрЗаменить(Стр,"{","");
			Разб = СтрЗаменить(Разб,"}","");
			МассивПарам = РазложитьСтрокуВМассив(Разб,",");
			 
			Нов = Табл.Добавить();
			Для Каждого Парам Из МассивПарам ЦИкл
				МассивОпис =РазложитьСтрокуВМассив(Парам,":");
				Если Найти(МассивОпис[0],"DefectID") Тогда
					Нов.ИмяЭлемента = МассивОпис[1];
				ИначеЕсли Найти(МассивОпис[0],"Comment") Тогда
					Нов.Комментарий = МассивОпис[1];
             	КонецЕсли;
					
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция РазложитьСтрокуВМассив(вхСтрока,Разделитель)
	МассивСтрок = новый Массив();
	ИтоговаяСтрока = вхСтрока;
	Поиск =Найти( ИтоговаяСтрока ,Разделитель);
	Пока Поиск>0 Цикл
		Если Поиск = 1 Тогда
			МассивСтрок.Добавить("");
		Иначе
			Доб = Лев(ИтоговаяСтрока,Поиск -1);
			МассивСтрок.Добавить(Доб);
			ИтоговаяСтрока = Прав(ИтоговаяСтрока,СтрДлина(ИтоговаяСтрока)- СтрДлина(Разделитель)- Поиск+1 );
			Поиск =Найти( ИтоговаяСтрока ,Разделитель);
   		КонецЕсли;
	КонецЦикла;
	МассивСтрок.Добавить(ИтоговаяСтрока);
 	Возврат МассивСтрок;
КонецФункции
